rtkconnectivity/hal_realtek/bee/rtl8752h/dfu/src/dfu_flash.c
/*
 * Copyright (c) 2025 Realtek Semiconductor Corp.
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#include <zephyr/kernel.h>
#include <zephyr/drivers/flash.h>

#include <zephyr/logging/log.h>
LOG_MODULE_DECLARE(DFU, CONFIG_DFU_LOG_LEVEL);
#include "log_adapter.h"

#include "aes_api.h"
#include "patch_header_check.h"
#include "hw_aes.h"
#include "rtl876x_hw_aes.h"
#include "otp.h"
#include "dfu_api.h"
#include "rtl876x_wdg.h"
#include "dfu_flash.h"
#include "rtl876x_hw_sha256.h"
#include "board.h"
#include "otp_config.h"
#include "flash_nor_device.h"
#include "flash_map.h"

#ifdef SUPPORT_SINGLE_BANK_OTA_USER_DATA
#if ((USER_DATA_START_ADDR & (FLASH_NOR_BLOCK_SIZE - 1)) != 0)
#error "User data start addr is not 64KB Aligned!!"
#endif
#endif

/*============================================================================*
 *                              Macros
 *============================================================================*/
#define BTAON_FAST_REBOOT_SW_INFO0 0x2

#define DECODE_OFFSET                 (sizeof(T_COMPRESS_IMG_HEADER_FORMAT))
#define COMPRESS_HEADER_SHA256_OFFSET 36

#define CRC_BUFFER_SIZE    128 // may modify to improve performance
#define SHA256_BUFFER_SIZE 128

#define SHA256_LENGTH 32

#define DFU_UPDATE_LEN 256

/*============================================================================*
 *                               Types
 *============================================================================*/

typedef union _BTAON_FAST_REBOOT_SW_INFO0_TYPE
{
    uint16_t d16;
    struct
    {
        uint16_t rsvd0: 5;
        uint16_t is_ota: 1; /* bit[5]: enter ota mode after reset           */
        uint16_t rsvd1: 10;
    } flag;
} BTAON_FAST_REBOOT_SW_INFO0_TYPE;

/*============================================================================*
 *                               Variables
 *============================================================================*/

bool dfu_compressed_mode = false;

#define FLASH_BASE_ADDRESS           DT_REG_ADDR(DT_CHOSEN(zephyr_flash))
#define FLASH_ADDR_TO_CACHE(address) ((address) & (~FLASH_OFFSET_TO_NO_CACHE))

const struct device *flash_dev = DEVICE_DT_GET(DT_CHOSEN(zephyr_flash_controller));

bool dfu_flash_read(uint32_t addr, uint8_t *data, uint32_t byte_len)
{
    return flash_read(flash_dev, FLASH_ADDR_TO_CACHE(addr - FLASH_BASE_ADDRESS), (void *)data,
                      byte_len) == 0;
}

bool dfu_flash_write(uint32_t addr, uint8_t *data, uint32_t byte_len)
{
    return flash_write(flash_dev, FLASH_ADDR_TO_CACHE(addr - FLASH_BASE_ADDRESS), (void *)data,
                       byte_len) == 0;
}

bool dfu_flash_erase_sector(uint32_t addr)
{
    bool result = false;
    result = (flash_erase(flash_dev, FLASH_ADDR_TO_CACHE(addr - FLASH_BASE_ADDRESS), 0x1000) ==
              0);
    DFU_PRINT_INFO2("<==dfu flash erase sector: addr=%x, result=%d(1:success)", addr, result);
    return result;
}



/**
*  @brief: unlock flash is need when erase or write flash.
*/
bool unlock_flash_bp_all(void)
{
    extern bool flash_rtl8752h_unlock_flash_bp_all(const struct device * dev);
    return flash_rtl8752h_unlock_flash_bp_all(flash_dev);
}

/**
*  @brief: lock flash after erase or write flash.
*/
void lock_flash_bp(void)
{
    extern void flash_rtl8752h_lock_flash_bp(const struct device * dev);
    flash_rtl8752h_lock_flash_bp(flash_dev);
}

static void dfu_process_image_sha256(HW_SHA256_CTX *ctx, uint8_t *buf, uint32_t buf_max_size,
                                     uint8_t *pdata, size_t data_len, bool is_compressed_image)
{
    uint32_t i;
    uint32_t loop_cnt, remain_size;

    loop_cnt = data_len / buf_max_size;
    remain_size = data_len % buf_max_size;

    for (i = 0; i < loop_cnt; ++i)
    {
        dfu_flash_read((uint32_t)pdata, buf, buf_max_size);

        if (i == 0 && !is_compressed_image)
        {
            /* because not_ready is included when calculate image sha256 */
            ((T_IMG_CTRL_HEADER_FORMAT *)buf)->ctrl_flag.flag_value.not_ready = 0;
        }

        hw_sha256_cpu_update(ctx, buf, buf_max_size);
        pdata += buf_max_size;
    }
    if (remain_size)
    {
        dfu_flash_read((uint32_t)pdata, buf, remain_size);
        if (loop_cnt == 0 && !is_compressed_image)
        {
            ((T_IMG_CTRL_HEADER_FORMAT *)buf)->ctrl_flag.flag_value.not_ready = 0;
        }

        hw_sha256_cpu_update(ctx, buf, remain_size);
    }
}

#if (SUPPORT_PUBLIC_DECODE_OTA == 1)
static bool dfu_check_compressed_image_sha256(T_COMPRESS_IMG_HEADER_FORMAT *p_header)
{
    /*
           Image layout is as below, and CRC will include part 2)
           1) Image Compress Header    96 bytes
           2) compressed app + header  bytes  -sha256
        */
    uint32_t sha256sum[SHA256_BYTE_SIZE / 4];
    uint8_t sha256img[SHA256_BYTE_SIZE];
    uint8_t buf[SHA256_BUFFER_SIZE] = {0};

    HW_SHA256_CTX ctx = {0};
    hw_sha256_init();
    hw_sha256_start(&ctx, NULL);

    uint8_t *pdata = (uint8_t *)p_header + sizeof(T_COMPRESS_IMG_HEADER_FORMAT);
    dfu_process_image_sha256(&ctx, buf, SHA256_BUFFER_SIZE, pdata,
                             p_header->ctrl_header.payload_len, true);

    hw_sha256_finish(&ctx, sha256sum);

    pdata = (uint8_t *)p_header + COMPRESS_HEADER_SHA256_OFFSET;
    dfu_flash_read((uint32_t)pdata, sha256img, SHA256_LENGTH);

    return (memcmp(sha256img, sha256sum, SHA256_LENGTH) == 0);
}

/**
 * @brief  calculated checksum(CRC16 or SHA256 determined by image) over the image, and compared
 *         with given checksum value.
 * @param  p_header image header info of the given image.
 * @return true if image integrity check pass via checksum compare, false otherwise.
 */
static bool check_compressed_image_chksum(T_COMPRESS_IMG_HEADER_FORMAT *p_header)
{
    return dfu_check_compressed_image_sha256(p_header);
}
#endif

static bool dfu_check_sha256(T_IMG_HEADER_FORMAT *p_header)
{
    uint32_t sha256sum[SHA256_LENGTH / 4];
    uint8_t sha256img[SHA256_LENGTH];
    uint8_t buf[SHA256_BUFFER_SIZE] = {0};
    uint32_t len;
    uint8_t *pdata = (uint8_t *)&p_header->ctrl_header;

    dfu_flash_read((uint32_t)pdata + offsetof(T_IMG_CTRL_HEADER_FORMAT, payload_len),
                   (uint8_t *)&len, 4);
    len += sizeof(T_IMG_HEADER_FORMAT) - sizeof(T_AUTH_HEADER_FORMAT);

    HW_SHA256_CTX ctx = {0};
    hw_sha256_init();
    hw_sha256_start(&ctx, NULL);

