rtkconnectivity/hal_realtek/bee/rtl8752h/dfu/src/dfu_flash.c
    dfu_process_image_sha256(&ctx, buf, SHA256_BUFFER_SIZE, pdata, len, false);

    hw_sha256_finish(&ctx, sha256sum);

    dfu_flash_read((uint32_t)&p_header->auth.image_hash, sha256img, SHA256_LENGTH);

    return (memcmp(sha256img, sha256sum, SHA256_LENGTH) == 0);
}

/**
 * @brief check flash area is blank
 * @param  image_id          image_id to identify FW.
 * @param  offset             offset of the image.
 * @param  size               size to check.
 * @return  0 if blank check successfully, error line number otherwise
 */
static uint32_t dfu_flash_check_blank(uint16_t image_id, uint32_t offset, uint16_t size)
{
    uint32_t i = 0;
    uint32_t result = 0;
    uint32_t start_addr = 0;

    if (size & 0x3)
    {
        result = __LINE__;
        goto L_Return;
    }

    if ((image_id != IMAGE_USER_DATA) && (image_id != IMAGE_USER_DATA2) &&
        (image_id < OTA || image_id >= IMAGE_MAX))
    {
        result = __LINE__;
        goto L_Return;
    }

    start_addr = dfu_get_temp_ota_bank_addr_by_img_id((T_IMG_ID)image_id) + offset;

    if (start_addr == 0)
    {
        result = __LINE__;
        goto L_Return;
    }

    for (i = 0; i < size / 4; i++)
    {
        uint32_t r_data;
        if (dfu_flash_read(start_addr, (uint8_t *)&r_data, 4))
        {
            if (r_data != 0xFFFFFFFF)
            {
                result = __LINE__;
                goto L_Return;
            }
            start_addr += 4;
        }
        else
        {
            result = __LINE__;
            goto L_Return;
        }
    }

L_Return:
    DFU_PRINT_INFO4("<==dfu_flash_check_blank: image_id=0x%x, size=%d, addr=%d, result=%d",
                    image_id, size, start_addr, result);
    return result;
}

/**
 * @brief  set specified image valid bit..
 * @param  p_header      specified image.
 * @return true if ready bit sets to 0, false otherwise
 */
void dfu_set_compressed_ready(T_COMPRESS_IMG_HEADER_FORMAT *p_header)
{
    /* clear not_ready and compressed_not_ready bit */
    uint8_t image_header[DFU_HEADER_SIZE];

    dfu_flash_read((uint32_t)&p_header->ctrl_header, image_header, DFU_HEADER_SIZE);

    ((T_IMG_CTRL_HEADER_FORMAT *)image_header)->ctrl_flag.flag_value.compressed_not_ready = 0;

    dfu_flash_write((uint32_t)&p_header->ctrl_header, image_header, DFU_HEADER_SIZE);
}

/**
 * @brief  set specified image valid bit..
 * @param  p_header      specified image.
 * @return true if ready bit sets to 0, false otherwise
 */
void dfu_set_ready(T_IMG_HEADER_FORMAT *p_header)
{
    uint8_t image_header[DFU_HEADER_SIZE];

    dfu_flash_read((uint32_t)&p_header->ctrl_header, image_header, DFU_HEADER_SIZE);

    ((T_IMG_CTRL_HEADER_FORMAT *)image_header)->ctrl_flag.flag_value.not_ready = 0;

    dfu_flash_write((uint32_t)&p_header->ctrl_header, image_header, DFU_HEADER_SIZE);
}

void dfu_set_obsolete(T_IMG_HEADER_FORMAT *p_header)
{
    uint8_t image_header[DFU_HEADER_SIZE];

    dfu_flash_read((uint32_t)&p_header->ctrl_header, image_header, DFU_HEADER_SIZE);
    ((T_IMG_CTRL_HEADER_FORMAT *)image_header)->ctrl_flag.flag_value.not_obsolete = 0;

    dfu_flash_write((uint32_t)&p_header->ctrl_header, image_header, DFU_HEADER_SIZE);
}

uint32_t dfu_get_active_bank_image_addr_by_img_id(T_IMG_ID image_id)
{
    if (image_id == IMAGE_USER_DATA)
    {
        return flash_nor_get_bank_addr(FLASH_BKP_DATA1) | FLASH_OFFSET_TO_NO_CACHE;
    }
    else if (image_id == IMAGE_USER_DATA2)
    {
        return flash_nor_get_bank_addr(FLASH_BKP_DATA2) | FLASH_OFFSET_TO_NO_CACHE;
    }
    else
    {
        return get_header_addr_by_img_id(image_id);
    }
}

uint32_t dfu_get_temp_ota_bank_addr_by_img_id(T_IMG_ID image_id)
{
    if (image_id == IMAGE_USER_DATA)
    {
        return flash_nor_get_bank_addr(FLASH_BKP_DATA1) | FLASH_OFFSET_TO_NO_CACHE;
    }
    else if (image_id == IMAGE_USER_DATA2)
    {
        return flash_nor_get_bank_addr(FLASH_BKP_DATA2) | FLASH_OFFSET_TO_NO_CACHE;
    }
    else
    {
        return get_temp_ota_bank_addr_by_img_id(image_id);
    }
}

uint32_t dfu_get_temp_ota_bank_size_by_img_id(T_IMG_ID image_id)
{
    if (IMAGE_USER_DATA == image_id)
    {
        return flash_nor_get_bank_size(FLASH_BKP_DATA1);
    }
    else if (IMAGE_USER_DATA2 == image_id)
    {
        return flash_nor_get_bank_size(FLASH_BKP_DATA2);
    }
    else
    {
        return patch_get_temp_ota_bank_size_by_img_id((T_IMG_ID)image_id);
    }
}

/**
 * @brief check ota image size whether exceed flash layout address.
 */
static bool check_dfu_update_image_length(uint16_t image_id, uint32_t offset, uint32_t length,
                                          void *p_void, uint32_t *ret)
{
    uint32_t temp_bank_size = 0;
    *ret = 0;

    if (p_void == NULL)
    {
        *ret = __LINE__;
        return false;
    }

    temp_bank_size = dfu_get_temp_ota_bank_size_by_img_id((T_IMG_ID)image_id);

    if (offset == 0)
    {
        uint32_t total_length = 0;
#if (SUPPORT_PUBLIC_DECODE_OTA == 1)
        if (dfu_compressed_mode)
        {
            T_COMPRESS_IMG_HEADER_FORMAT *p_header =
                (T_COMPRESS_IMG_HEADER_FORMAT *)p_void;
            total_length = p_header->ctrl_header.payload_len + IMG_HEADER_SIZE;
        }
        else
        {
            T_IMG_HEADER_FORMAT *p_header = (T_IMG_HEADER_FORMAT *)p_void;
            total_length = p_header->ctrl_header.payload_len + IMG_HEADER_SIZE;
        }
#else
        T_IMG_HEADER_FORMAT *p_header = (T_IMG_HEADER_FORMAT *)p_void;
        total_length = p_header->ctrl_header.payload_len + IMG_HEADER_SIZE;
#endif
        if (total_length > temp_bank_size)
        {
            DFU_PRINT_ERROR2("New Image too large! total_length=%d, temp_bank_size=%d",
                             total_length, temp_bank_size);
            *ret = __LINE__;
            return false;
        }
    }

    if (offset + length > temp_bank_size)
    {
        DFU_PRINT_ERROR3("New Image single packet too large! offset=%d, length=%d, "
                         "temp_bank_size=%d",
                         offset, length, temp_bank_size);
        *ret = __LINE__;
        return false;
    }

    /* check pass */
    return true;
}

