rtkconnectivity/hal_realtek/bee/rtl8752h/dfu/src/dfu_flash.c
static uint32_t dfu_write(uint32_t start_addr, uint32_t length, uint8_t *p_void)
{
    uint32_t result = 0;
    uint16_t loop_cnt = 0;
    uint16_t remain_size = 0;
    uint8_t s_val[DFU_UPDATE_LEN];

    loop_cnt = length / DFU_UPDATE_LEN;
    remain_size = length % DFU_UPDATE_LEN;
    DFU_PRINT_INFO2("dfu_write: start_addr=0x%x, length=%d", start_addr, length);

    for (int i = 0; i < loop_cnt; i++)
    {
        if (dfu_flash_write(start_addr + i * DFU_UPDATE_LEN, p_void + i * DFU_UPDATE_LEN,
                            DFU_UPDATE_LEN))
        {

            if (dfu_flash_read(start_addr + i * DFU_UPDATE_LEN, s_val,
                               DFU_UPDATE_LEN))
            {
                if (0 !=
                    memcmp(s_val, p_void + i * DFU_UPDATE_LEN, DFU_UPDATE_LEN))
                {
                    return __LINE__;
                }
            }
            else
            {
                return __LINE__;
            }
        }
        else
        {
            return __LINE__;
        }
    }

    if (remain_size)
    {
        if (dfu_flash_write(start_addr + loop_cnt * DFU_UPDATE_LEN,
                            p_void + loop_cnt * DFU_UPDATE_LEN, remain_size))
        {
            if (dfu_flash_read(start_addr + loop_cnt * DFU_UPDATE_LEN, s_val,
                               remain_size))
            {
                /* ensure p_void is ram addr */
                if (0 != memcmp(s_val, p_void + loop_cnt * DFU_UPDATE_LEN,
                                remain_size))
                {
                    return __LINE__;
                }
            }
            else
            {
                return __LINE__;
            }
        }
        else
        {
            return __LINE__;
        }
    }

    return result;
}

/*============================================================================*
 *                              External Functions
 *============================================================================*/

/**
 * @brief set aon reg value means whether in OTA mode or not.
 */
void dfu_set_ota_mode_flag(bool enable)
{
    BTAON_FAST_REBOOT_SW_INFO0_TYPE nFastBoot =
        (BTAON_FAST_REBOOT_SW_INFO0_TYPE)btaon_fast_read_safe(BTAON_FAST_REBOOT_SW_INFO0);
    if (enable)
    {
        nFastBoot.flag.is_ota = 1;
    }
    else
    {
        nFastBoot.flag.is_ota = 0;
    }
    btaon_fast_write_safe(BTAON_FAST_REBOOT_SW_INFO0, nFastBoot.d16);
    DFU_PRINT_INFO1("dfu_set_ota_mode_flag ota(%d)", nFastBoot.flag.is_ota);
}

/**
 * @brief switch to the OTA mode, if support normal ota app need call it.
 */
void dfu_switch_to_ota_mode(void)
{
    DFU_PRINT_INFO0("[==>dfu_switch_to_ota_mode");
    dfu_set_ota_mode_flag(true);
    WDG_SystemReset(RESET_ALL_EXCEPT_AON, DFU_SWITCH_TO_OTA_MODE);
}

/**
 * @brief OTA procedure do wdg system reset.
 * @param  is_active_fw true means dfu success! otherwise fail.
 */
void dfu_fw_reboot(bool is_active_fw)
{
    DFU_PRINT_TRACE1("==>dfu_fw_reboot: is_active_fw=%d", is_active_fw);
    if (is_active_fw)
    {
        WDG_SystemReset(RESET_ALL, DFU_ACTIVE_RESET);
    }
    else
    {
        WDG_SystemReset(RESET_ALL, DFU_FAIL_RESET);
    }
}

bool dfu_get_enc_setting(void)
{
    return OTP->ota_with_encryption_data;
}

/**
 * @brief OTA image default ecb mode aes decrypt, last less then 16bytes no encrypted.
 */
void dfu_hw_aes_decrypt_image(uint8_t *input, uint8_t *output, uint32_t length)
{
    uint32_t offset = 0;

    uint32_t aes_key[8] = {0x118E601A, 0x960D4CD3, 0x807A7E70, 0x1F6763DF,
                           0xD1F610FB, 0x9A971A0C, 0x092B29E2, 0x4E46F8C5
                          };

    hw_aes_init(aes_key, NULL, AES_MODE_ECB, dfu_get_enc_setting());
    do
    {
        if ((length - offset) >= 16)
        {
            hw_aes_decrypt_16byte(input + offset, output + offset);
            offset += 16;
        }
        else
        {
            break;
        }
    }
    while (1);
}

/**
 * @brief DFU encrypt handshake data.
 */
void dfu_encrypt_handshake_data(uint8_t data[16])
{
    aes256_ecb_encrypt(data, (uint8_t *)OTP->aes_key, data);
}

/**
 * @brief  report specified target ic type.
 * @param  image_id     image_id to identify FW.
 * @param  p_ic_type     To store ic type.
 * @return 0 if report ic type info successfully, error line number otherwise
 */
uint32_t dfu_report_target_ic_type(uint16_t image_id, uint8_t *p_ic_type)
{
    uint32_t result = 0;
    T_IMG_HEADER_FORMAT *p_header;

    if (!p_ic_type)
    {
        result = __LINE__;
        goto L_Return;
    }

    p_header =
        (T_IMG_HEADER_FORMAT *)dfu_get_active_bank_image_addr_by_img_id((T_IMG_ID)image_id);

    if (!p_header)
    {
        result = __LINE__;
        goto L_Return;
    }

    *p_ic_type = p_header->ctrl_header.ic_type;

L_Return:
    DFU_PRINT_INFO1("<==dfu_report_target_ic_type: result=%d", result);
    return result;
}

/**
 * @brief  report specified FW info and current OTA offset.
 * @param  image_id          image_id to identify FW.
 * @param  p_origin_fw_version     To store current FW version.
 * @param  p_offset            To store current file offset.
 * @return 0 if report FW info successfully, error line number otherwise
 */
uint32_t dfu_report_target_fw_info(uint16_t image_id, uint32_t *p_origin_fw_version,
                                   uint32_t *p_offset)
{
    uint32_t result = 0;
    T_IMG_HEADER_FORMAT *p_header;

    if (!p_offset)
    {
        result = __LINE__;
        goto L_Return;
    }

    if (!p_origin_fw_version)
    {
        result = __LINE__;
        goto L_Return;
    }

    p_header =
        (T_IMG_HEADER_FORMAT *)dfu_get_active_bank_image_addr_by_img_id((T_IMG_ID)image_id);

    if (!p_header)
    {
        result = __LINE__;
        goto L_Return;
    }

    if (image_id == OTA)
    {
        T_IMG_HEADER_FORMAT *p_ota_header;
        p_ota_header = (T_IMG_HEADER_FORMAT *)p_header;
        *p_origin_fw_version = p_ota_header->ver_val;
    }
    else if ((IMAGE_USER_DATA == image_id) || (IMAGE_USER_DATA2 == image_id) ||
             (image_id >= SecureBoot && image_id < IMAGE_MAX))
    {
        *p_origin_fw_version = p_header->git_ver.ver_info.version;
    }
    else   // image_id don't support
    {
        result = __LINE__;
        goto L_Return;
    }

    /*bee2 default don't support re-ota*/
    *p_offset = 0;

