rtkconnectivity/hal_realtek/bee/rtl8752h/dfu/src/dfu_flash.c
L_Return:
    DFU_PRINT_INFO1("<==dfu_report_target_fw_info: result=%d", result);
    return result;
}

/**
 * @brief calculate checksum of lenth of buffer in flash.
 * @param  buf                data.
 * @param  length             length of data, must align 2bytes.
 * @param  crc_val            ret crc value point.
 * @return  0 if buffer checksum calcs successfully, error line number otherwise
 */

uint32_t dfu_check_buf_crc(uint8_t *buf, uint32_t length, uint16_t crc_val)
{
    uint16_t checksum16 = 0;
    uint32_t result = 0;
    uint32_t i;
    uint16_t *p16;

    if (length & 0x1)
    {
        result = __LINE__;
        goto L_Return;
    }

    p16 = (uint16_t *)buf;
    for (i = 0; i < length / 2; ++i)
    {
        checksum16 = checksum16 ^ (*p16);
        ++p16;
    }

    checksum16 = ((checksum16 & 0xff) << 8) | ((checksum16 & 0xff00) >> 8);

    if (checksum16 != crc_val)
    {
        result = __LINE__;
        goto L_Return;
    }

L_Return:
    DFU_PRINT_INFO4("<==dfu_check_buf_crc: length=%d, checksum16=0x%x, crc_val=0x%x, result:%d",
                    length, checksum16, crc_val, result);
    return result;
}

/**
 * @brief erase a sector of the flash, will retry three times at most
 *
 * @param  image_id          image_id to identify FW.
 * @param  offset             offset of the image.
 * @return  0 if erase successfully, error line number otherwise,
 */
uint32_t dfu_flash_erase_sector_with_retry(uint16_t image_id, uint32_t offset)
{
    uint32_t result = 0;
    uint32_t cnt = 0;
    uint32_t dfu_base_addr = 0;

    dfu_base_addr = dfu_get_temp_ota_bank_addr_by_img_id((T_IMG_ID)image_id);

    if (dfu_base_addr == 0)
    {
        result = __LINE__;
        goto L_Return;
    }

    do
    {
        unlock_flash_bp_all();
        dfu_flash_erase_sector(dfu_base_addr + offset);
        lock_flash_bp();
        result = dfu_flash_check_blank(image_id, offset, FLASH_NOR_SECTOR_SIZE);
        if (!result)
        {
            /* erase ok */
            break;
        }
        else
        {
            /* retry */
            cnt++;
        }
        if (cnt >= 3)
        {
            /*retry three times all fail*/
            goto L_Return;
        }
    }
    while (1);

L_Return:
    DFU_PRINT_INFO2("dfu_flash_erase_with_retry: cnt=%d, result=%d", cnt, result);
    return result;
}

/**
 * @brief  write specified image data with specified length to flash
 * @param  image_id          image_id to identify FW.
 * @param  offset             offset of the image.
 * @param  length             length of data.
 * @param  p_void             pointer to data.
 * @return 0 if write FW image successfully, error line number otherwise
 */
uint32_t dfu_update(uint16_t image_id, uint32_t offset, uint32_t total_offset, uint32_t length,
                    uint32_t *p_void)
{
    uint32_t result = 0;
    uint32_t dfu_base_addr = 0;
    uint32_t start_addr = 0;
    bool erase_rst = true; // default value must be true

    DFU_PRINT_INFO3("==>dfu_update: offset=0x%x, total_offset=0x%x, length=%d", offset,
                    total_offset, length);

    if (length % 4)
    {
        result = __LINE__;
        goto L_Return;
    }

    if (p_void == 0)
    {
        result = __LINE__;
        goto L_Return;
    }

    dfu_base_addr = dfu_get_temp_ota_bank_addr_by_img_id((T_IMG_ID)image_id);

    if (dfu_base_addr == 0)
    {
        result = __LINE__;
        goto L_Return;
    }

    /* before erase temp image or write image to flash temp, check access length depend flash
     * layout */
    if (!check_dfu_update_image_length(image_id, offset, length, p_void, &result))
    {
        goto L_Return;
    }

    /*if it's start_packet*/
    if (offset == 0 && length > offsetof(T_IMG_HEADER_FORMAT, uuid))
    {
#if (SUPPORT_PUBLIC_DECODE_OTA == 1)
        if (dfu_compressed_mode)
        {
            T_COMPRESS_IMG_HEADER_FORMAT *p_compressed_header =
                (T_COMPRESS_IMG_HEADER_FORMAT *)p_void;
            if (IMAGE_COMPRESSED ==
                p_compressed_header->ctrl_header.ctrl_flag.flag_value.image_type)
            {
                /*access ram addr, make sure image is not ready*/
                p_compressed_header->ctrl_header.ctrl_flag.flag_value
                .compressed_not_ready = 0x1;
            }
        }
        else
        {
            T_IMG_HEADER_FORMAT *p_header = (T_IMG_HEADER_FORMAT *)p_void;
            /*access ram addr, make sure image is not ready*/
            p_header->ctrl_header.ctrl_flag.flag_value.not_ready = 0x1;
        }
#else
        T_IMG_HEADER_FORMAT *p_header = (T_IMG_HEADER_FORMAT *)p_void;
        /*access ram addr, make sure image is not ready*/
        p_header->ctrl_header.ctrl_flag.flag_value.not_ready = 0x1;
#endif
        DFU_PRINT_TRACE3(
            "<==dfu_update: New Image Header=0x%x, image_id=0x%x, dfu_base_addr=0x%x",
            length, image_id, dfu_base_addr);
    }

    start_addr = dfu_base_addr + offset;

    unlock_flash_bp_all();

    /*other images need add total offset in temp bank*/
    start_addr += total_offset;

    if ((start_addr % FLASH_NOR_SECTOR_SIZE) == 0) // new sector starts
    {
        erase_rst = dfu_flash_erase_sector(start_addr);
    }
    else   // only cross two sector
    {
        /* write space cross two sector. Note: dfu_base_addr have been 4K align */
        /* if buffer size more than 4K, may cross more than two sectors */
        if ((start_addr / FLASH_NOR_SECTOR_SIZE) !=
            ((start_addr + length) / FLASH_NOR_SECTOR_SIZE))
        {
            if ((start_addr + length) % FLASH_NOR_SECTOR_SIZE)
            {
                erase_rst = dfu_flash_erase_sector((start_addr + length) &
                                                   ~(FLASH_NOR_SECTOR_SIZE - 1));
            }
        }
    }

    if (!erase_rst)
    {
        /* erase fail */
        result = __LINE__;
        goto L_Return;
    }

    /* write data to flash */
    result = dfu_write(start_addr, length, (uint8_t *)p_void);
    lock_flash_bp();

