rtkconnectivity/hal_realtek/bee/rtl8752h/dfu/src/dfu_flash.c
L_Return:
    DFU_PRINT_INFO1("<==dfu_update: result=%d", result);
    return result;
}

/**
 * @brief calculate checksum of the image and compare with given checksum value.
 *
 * @param   image_id     image id to identify image.
 * @return  true if the image integrity check passes, false otherwise
 */
bool dfu_check_checksum(uint16_t image_id, uint32_t offset)
{
    uint32_t error_code = 0;
    bool check_result = false;
    uint32_t base_addr = 0;
    T_IMG_HEADER_FORMAT *p_header;

    base_addr = dfu_get_temp_ota_bank_addr_by_img_id((T_IMG_ID)image_id);

    if (base_addr == 0)
    {
        error_code = __LINE__;
        goto L_Return;
    }

    if (!is_ota_support_bank_switch())
    {
        base_addr += offset;
    }

#if (SUPPORT_PUBLIC_DECODE_OTA == 1)
    if (dfu_compressed_mode)
    {
        T_COMPRESS_IMG_HEADER_FORMAT *p_compressed_header =
            (T_COMPRESS_IMG_HEADER_FORMAT *)base_addr;
        if (IMAGE_COMPRESSED ==
            p_compressed_header->ctrl_header.ctrl_flag.flag_value.image_type)
        {
            check_result = check_compressed_image_chksum(p_compressed_header);
        }
        else
        {
            error_code = __LINE__;
            goto L_Return;
        }
    }
    else
    {
        p_header = (T_IMG_HEADER_FORMAT *)base_addr;
        check_result = dfu_check_sha256(p_header);
    }
#else
    p_header = (T_IMG_HEADER_FORMAT *)base_addr;
    check_result = dfu_check_sha256(p_header);
#endif

    if (!check_result)
    {
        error_code = __LINE__;
        goto L_Return;
    }

    /*when disable bank switch, set image ready later*/
    if (is_ota_support_bank_switch())
    {
        dfu_set_image_ready(p_header, false);
    }

L_Return:
    DFU_PRINT_INFO3("<==dfu_check_checksum: check_result:%d, ota_tmp_addr:0x%x, error_code:%d",
                    check_result, base_addr, error_code);
    return check_result;
}

void dfu_set_image_ready(T_IMG_HEADER_FORMAT *p_header, bool compressed_mode)
{
    unlock_flash_bp_all();
#if (SUPPORT_PUBLIC_DECODE_OTA == 1)
    if (compressed_mode)
    {
        T_COMPRESS_IMG_HEADER_FORMAT *p_compressed_header =
            (T_COMPRESS_IMG_HEADER_FORMAT *)p_header;
        /*only set compressed_not_reay to 0, and not_ready still is 1
        so that bootlader won't copy compressed image*/
        if (IMAGE_COMPRESSED ==
            p_compressed_header->ctrl_header.ctrl_flag.flag_value.image_type)
        {
            dfu_set_compressed_ready(p_compressed_header);
        }
        else
        {
            DFU_PRINT_INFO1("dfu_set_image_ready: image_type %d error!",
                            p_header->ctrl_header.ctrl_flag.flag_value.image_type);
            return;
        }
    }
    else
    {
        dfu_set_ready(p_header);
    }
#else
    dfu_set_ready(p_header);
#endif
    lock_flash_bp();
}

#if (ENABLE_BANK_SWITCH_COPY_APP_DATA == 1)
extern uint8_t *p_ota_temp_buffer_head;
/**
 * @brief   copy appdata from active bank to updating bank.
 *
 * @param   image_id    image_id to identify image.
 * @param   dlAddress   address the img copy to.
 * @param   dlSize      copy size.
 * @return  true if the image copied success, false otherwise
 */
bool dfu_copy_img(uint16_t image_id, uint32_t dlAddress, uint32_t dlSize)
{
    uint32_t error_code = 0;
    uint32_t source_base_addr;
    uint32_t dest_base_addr;
    int remain_size = dlSize;
    uint32_t s_val;
    uint32_t dlOffset, tmp_offset;

    if ((image_id < AppData1) || (image_id > AppConfigFile))
    {
        error_code = __LINE__;
        goto L_Return;
    }
    if (dlAddress % 4096)
    {
        error_code = __LINE__;
        goto L_Return;
    }

    source_base_addr = get_active_ota_bank_addr() & 0xffffff;

    if (flash_nor_get_bank_addr(FLASH_OTA_BANK_0) == get_active_ota_bank_addr())
    {
        dest_base_addr = flash_nor_get_bank_addr(FLASH_OTA_BANK_1) & 0xffffff;
    }
    else
    {
        dest_base_addr = flash_nor_get_bank_addr(FLASH_OTA_BANK_0) & 0xffffff;
    }
    if ((source_base_addr % 4096) || (dest_base_addr % 4096))
    {
        error_code = __LINE__;
        goto L_Return;
    }
    if (dest_base_addr >= dlAddress)
    {
        error_code = __LINE__;
        goto L_Return;
    }
    dlOffset = dlAddress - dest_base_addr;
    tmp_offset = dlOffset;
    if (dlOffset % 4096)
    {
        error_code = __LINE__;
        goto L_Return;
    }
    T_IMG_HEADER_FORMAT *p_data_header;
    p_data_header = (T_IMG_HEADER_FORMAT *)(source_base_addr + dlOffset);
    if (p_data_header->ctrl_header.image_id != image_id)
    {
        error_code = __LINE__;
        goto L_Return;
    }

    while (remain_size > 0)
    {
        if (!((dest_base_addr + tmp_offset) % 4096)) // must 4k align
        {
            dfu_flash_erase_sector(dest_base_addr + tmp_offset);
        }
        if (remain_size > 2048)
        {
            memcpy(p_ota_temp_buffer_head, (uint8_t *)(source_base_addr + tmp_offset),
                   2048);
            if (remain_size == dlSize)
            {
                T_IMG_CTRL_HEADER_FORMAT *p_header =
                    (T_IMG_CTRL_HEADER_FORMAT *)p_ota_temp_buffer_head;
                p_header->ctrl_flag.flag_value.not_ready =
                    0x1; /*make sure image is not ready, will use it later*/
            }
            for (int i = 0; i < 2048; i = i + 4)
            {
                dfu_flash_write(dest_base_addr + tmp_offset + i,
                                p_ota_temp_buffer_head, 4);
                dfu_flash_read((dest_base_addr + tmp_offset + i), (uint8_t *)&s_val,
                               4);
                if (s_val != *(uint32_t *)p_ota_temp_buffer_head)
                {
                    DFU_PRINT_TRACE3("s_val:0x%08x, *p_void:0x%08x, i:0x%08x",
                                     s_val, *(uint32_t *)p_ota_temp_buffer_head,
                                     i);
                    error_code = __LINE__;
                    goto L_Return;
                }
                else
                {
                    p_ota_temp_buffer_head += 4;
                }
            }

            remain_size -= 2048;
        }
        else
        {
            memcpy(p_ota_temp_buffer_head, (uint8_t *)(source_base_addr + tmp_offset),
                   remain_size);
            for (int i = 0; i < remain_size; i = i + 4)
            {
                dfu_flash_write(dest_base_addr + tmp_offset + i,
                                p_ota_temp_buffer_head, 4);
                dfu_flash_read((dest_base_addr + tmp_offset + i), (uint8_t *)&s_val,
                               4);
                if (s_val != *(uint32_t *)p_ota_temp_buffer_head)
                {
                    DFU_PRINT_TRACE3("s_val:0x%08x, *p_void:0x%08x, i:0x%08x",
                                     s_val, *(uint32_t *)p_ota_temp_buffer_head,
                                     i);
                    error_code = __LINE__;
                    goto L_Return;
                }
                else
                {
                    p_ota_temp_buffer_head += 4;
                }
            }
            remain_size = 0;
        }
        tmp_offset += 2048;
    }

L_Return:
    DFU_PRINT_INFO1("<====dfu_copy_img  error_code:%d", error_code);
    if (error_code)
    {
        return false;
    }
    return true;
}
#endif // end ENABLE_BANK_SWITCH_COPY_APP_DATA
